In [2]:
import pandas as pd

# load Employee Data 
employee = pd.read_csv("employee.csv")
employee

   Emp_id     Name  Dept_id  Unnamed: 3  Unnamed: 4  Unnamed: 5  Unnamed: 6
0     101   Prasad      1.0         NaN         NaN         NaN         NaN
1     102      Joy      2.0         NaN         NaN         NaN         NaN
2     103  Nishant      1.0         NaN         NaN         NaN         NaN
3     104    Reena      3.0         NaN         NaN         NaN         NaN
4     105    Bhumi      NaN         NaN         NaN         NaN         NaN

In [7]:
employee = employee.drop(['Unnamed: 3','Unnamed: 4','Unnamed: 5','Unnamed: 6'],axis=1)

In [8]:
employee

   Emp_id     Name  Dept_id
0     101   Prasad      1.0
1     102      Joy      2.0
2     103  Nishant      1.0
3     104    Reena      3.0
4     105    Bhumi      NaN

In [4]:
# load Employee Data 
departments = pd.read_csv("departments.csv")
departments

,Dept_id,Dept_Name,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
0,1,HR,NaN,NaN,NaN,NaN,NaN
1,2,IT,NaN,NaN,NaN,NaN,NaN
2,3,Finance,NaN,NaN,NaN,NaN,NaN
3,4,Marketing,NaN,NaN,NaN,NaN,NaN

In [9]:
# delete unuse column 
departments = departments.drop(['Unnamed: 2','Unnamed: 3','Unnamed: 4','Unnamed: 5','Unnamed: 6'],axis=1)
departments

   Dept_id  Dept_Name
0        1         HR
1        2         IT
2        3    Finance
3        4  Marketing

In [13]:
# check data type 
employee.dtypes

Emp_id       int64
Name        object
Dept_id    float64
dtype: object

In [14]:
# convert flot to int 
employee.columns

Index(['Emp_id', 'Name', 'Dept_id'], dtype='object')

In [21]:
employee['Dept_id'] = employee['Dept_id'].astype("Int64")
# import numpy as np
# employee['Dept_id'] = np.ceil(employee['Dept_id']).astype(int)

In [22]:
employee.dtypes

Emp_id      int64
Name       object
Dept_id     Int64
dtype: object

In [23]:
print(employee)
print(departments)

   Emp_id     Name  Dept_id
0     101   Prasad        1
1     102      Joy        2
2     103  Nishant        1
3     104    Reena        3
4     105    Bhumi     <NA>
   Dept_id  Dept_Name
0        1         HR
1        2         IT
2        3    Finance
3        4  Marketing

In [28]:
# inner join 
inner_join = pd.merge(employee,departments,on='Dept_id',how='inner')
inner_join

   Emp_id     Name  Dept_id Dept_Name
0     101   Prasad        1        HR
1     102      Joy        2        IT
2     103  Nishant        1        HR
3     104    Reena        3   Finance

In [29]:
# left join 
left_join = pd.merge(employee,departments,on='Dept_id',how='left')
left_join

   Emp_id     Name  Dept_id Dept_Name
0     101   Prasad        1        HR
1     102      Joy        2        IT
2     103  Nishant        1        HR
3     104    Reena        3   Finance
4     105    Bhumi     <NA>       NaN

In [30]:
# right join 
right_join = pd.merge(employee,departments,on='Dept_id',how='right')
right_join

   Emp_id     Name  Dept_id  Dept_Name
0   101.0   Prasad        1         HR
1   103.0  Nishant        1         HR
2   102.0      Joy        2         IT
3   104.0    Reena        3    Finance
4     NaN      NaN        4  Marketing

In [31]:
# outer join 
outer_join = pd.merge(employee,departments,on='Dept_id',how='outer')
outer_join

   Emp_id     Name  Dept_id  Dept_Name
0   101.0   Prasad        1         HR
1   103.0  Nishant        1         HR
2   102.0      Joy        2         IT
3   104.0    Reena        3    Finance
4     NaN      NaN        4  Marketing
5   105.0    Bhumi     <NA>        NaN

In [45]:
# joined_df = employee.set_index("Dept_id").join(departments.set_index("Dept_id"),how="left")
joined_df=employee.merge(departments, on="Dept_id",how="left")
joined_df

         Emp_id     Name Dept_Name
Dept_id
1           101   Prasad        HR
2           102      Joy        IT
1           103  Nishant        HR
3           104    Reena   Finance
<NA>        105    Bhumi       NaN

In [46]:
# using join() for index based merging
# convert deptID into index

# employee.set_index("Dept_Id",inplace=True)
# departments.set_index("Dept_Id",inplace=True)

# joined_data = employee.join(departments,how="left")
# joined_data